app/controllers/books_controller.rb

SELECT * FROM "books" ORDER BY title LIMIT 20 OFFSET 0
SELECT count(*) AS count_all FROM "books"
---
  def index
    @books = Book.paginate  :per_page => 20, :page => params['page'],
                            :order => :title

SELECT * FROM "books" WHERE ("books"."id" = 317)
---
  def show
    @book = Book.find(params[:id])

SELECT * FROM "books" WHERE ("books"."id" = 2)
---
  def edit
    @book = Book.find(params[:id])

SELECT * FROM "books" WHERE ("books"."id" = 1)
DELETE FROM "books" WHERE "id" = 1
---
  def destroy
    @book = Book.find(params[:id])
    @book.destroy

SELECT * FROM "books" WHERE ("books"."id" = 384)
INSERT INTO "favourites" ("updated_at", "user_id", "book_id", "created_at") VALUES('2009-03-25 12:23:32', 1, 384, '2009-03-25 12:23:32')
---
  def select
    @book = Book.find(params[:id])
    @favourite = Favourite.new(:book => @book, :user => @user)

    respond_to do |format|
      if @favourite.save

SELECT * FROM "books" WHERE ("books"."id" = 384)
SELECT * FROM "favourites" WHERE ("favourites"."user_id" = 1 AND "favourites"."book_id" IS NULL) LIMIT 1
DELETE FROM "favourites" WHERE "id" = NULL
---
  def unselect
    @book = Book.find(params[:id])
    @favourite = Favourite.find_by_book_id_and_user_id(@book,@user)
    @favourite.destroy